/*
Условие:
    Общими требованиями к лабораторной работе являются:
    1) вводить   исходное   дерево  из  файла  в  понятной  для
    пользователя форме, а не с клавиатуры;
    2) по требованию прользователя показывать дерево на экране;
    3) обрабатывать  дерево  в  оперативной памяти,  а не путем
    многократного обращения к файлу;
    4) обеспечить   возможность   многократных   запросов   без
    повторного запуска программы.

    26. Информация  о  файлах  на  жестких  дисках   компьютера
    записана  с  помощью  дерева.  Обеспечить выполнение следующих
    операций:
    1) загрузку дерева в память из файла;
    2) обход дерева папок в  режиме  диалога  (раскрытие папок,
        подъем на уровень и т. п.); 
    3) корректировку  дерева при создании новых папок и файлов,
    их переименовании, копировании, переносе и удалении. 
    4) сохранение дерева в файле (13).

    Автор: Маймеску Максим

    Среда: Linux, Visual Studio Code

    Источники: 
    лекция
*/

#include <iostream>
#include <fstream>
#include <string>

int main() 
{
    std::cout << 1 << std::endl;
}